Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: How should they perfect the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the five extrasensory powers, all the meditative stabilities, and all the dhāraṇī gateways?

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: How should they perfect the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas?

source: །མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: How should they perfect the thirty-two major marks of a great person and how should they perfect the eighty excellent minor marks?

source: །འོད་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: How should they perfect a great aureole of light?

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་པར་བྱས་ཏེ། དབྱངས་གཅིག་གིས་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་བསྟན་པའི་ཚངས་པའི་དབྱངས་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །ཞེས་བགྱི་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: How should they perfect the voice of Brahmā through which they can teach the Dharma with a single sound to the beings of the world systems of the ten directions in accordance with their resolve, having comprehended with their minds the thoughts in the minds of those beings?” “

source: གང་ཁྱོད་ཀྱིས་བརྗོད་པའི་ཆོས་དེ་དག་རྨི་ལམ་ལྟ་བུ་དང་། སྒྲ་བརྙན་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུ་མ་ཡིན་ནམ། གསོལ་པ།
en: Subhūti,” asked the Blessed One in return, “do you think that these phenomena that you have mentioned are like a dream, like an echo, like an optical aberration, like a mirage, like a magical display, and like a phantom emanation?” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་དེ་དག་རྨི་ལམ་ལྟ་བུ་དང་། སྒྲ་བརྙན་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་།
en: Blessed Lord, if these phenomena are like a dream, like an echo, like an optical aberration, like a mirage, like a magical display, and like a phantom emanation, {Ki.

source: སྤྲུལ་པ་ལྟ་བུ་ལགས་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ།
en: VIII: 165} how do bodhisattva great beings practice the perfection of wisdom?

source: བཅོམ་ལྡན་འདས་རྨི་ལམ་ནི་ཡང་དག་པ་མ་ལགས།
en: Blessed Lord, dreams are not real.

source: སྒྲ་བརྙན་དང་། མིག་ཡོར་དང་། སྨིག་རྒྱུ་དང་། སྒྱུ་མ་དང་། སྤྲུལ་པ་ནི་ཡང་དག་པ་མ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་ཡང་དག་པ་མ་ལགས་པས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པ་དང་། ནང་སྟོང་པ་ཉིད་ལ་སྤྱད་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད། སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་།
en: Echoes, optical aberrations, mirages, magical displays, and phantom emanations are not real.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ།
en: Blessed Lord, because phenomena are not real, they cannot attain consummate buddhahood in unsurpassed, complete enlightenment, having practiced the perfection of generosity; having practiced the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; having practiced the emptiness of internal phenomena; having practiced [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity; and having practiced the thirty-seven factors conducive to enlightenment, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, all the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ཏེ། དེ་དེ་བཞིན་ནོ། །ཡང་དག་པ་མ་ཡིན་པས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པ་དང་། ནང་སྟོང་པ་ཉིད་ལ་སྤྱད་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྤྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ལ་སྤྱད་པ་དང་།
en: Subhūti, it is so! It is so,” replied the Blessed One. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ།
en: Because phenomena are not real, bodhisattva great beings cannot attain consummate buddhahood in unsurpassed, complete enlightenment, having practiced the perfection of generosity; having practiced the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; having practiced the emptiness of internal phenomena; having practiced [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity; having practiced the thirty-seven factors conducive to enlightenment; having practiced the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and all the dhāraṇī gateways; and having practiced the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas. “

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་འམ། གསོལ་པ།
en: Subhūti, do you think that the perfection of generosity will attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་འམ།
en: Subhūti,” continued the Blessed One, “do you think that the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom will attain consummate buddhahood in unsurpassed, complete enlightenment?

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་འམ། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: Will all the aspects of emptiness and the thirty-seven factors conducive to enlightenment attain consummate buddhahood in unsurpassed, complete enlightenment?

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའམ།
en: Will the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways attain consummate buddhahood in unsurpassed, complete enlightenment?

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་འམ།
en: Will the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: No, Blessed Lord!” “

source: བམ་པོ་བདུན་ཅུ་ལྔ་པ།
en: Subhūti, it is so!

source: །དེ་དེ་བཞིན་ཏེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ།
en: The perfection of generosity will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །ནང་སྟོང་པ་ཉིད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ།
en: The emptiness of internal phenomena will not attain consummate buddhahood in unsurpassed, complete enlightenment. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: The applications of mindfulness will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas will not attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱང་འདུས་བྱས་པ། མངོན་པར་འདུས་བྱས་པ་སྟེ།
en: Subhūti, if you ask why, it is because all these attributes are indeed conditioned and brought into being.

source: འདུས་བྱས་པ་དང་། མངོན་པར་འདུས་བྱས་པའི་ཆོས་ཀྱིས་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་ནུས་སོ།
en: All-aspect omniscience cannot be attained by attributes that are conditioned and brought into being.

source: །རབ་འབྱོར་འོན་ཀྱང་ཆོས་དེ་དག་ནི་ཐམས་ཅད་ཀྱང་ལམ་སྒྲུབ་པ་དང་། ལམ་བསྐྱེད་པའི་རྒྱུར་འགྱུར་བ་སྟེ། འབྲས་བུ་ཐོབ་པའི་ཕྱིར་ནི་མ་ཡིན་ནོ།
en: Subhūti, although these attributes all attain the path and contribute to it, they do not lead to the attainment of the fruit.

source: །དེ་དག་གི་མི་སྐྱེ་བ་དང་། མི་འབྱུང་བ་གང་ཡིན་པ་ནི་མཚན་ཉིད་མེད་པའང་དེ་ཡིན་ཏེ། དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་གཟུང་སྟེ། དགེ་བའི་ཆོས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འམ། ནང་སྟོང་པ་ཉིད་དམ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ར
en: The nonarising and nonorigination of these attributes indeed denotes their absence of defining characteristics.

source: མ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནམ། འཕགས་པའི་བདེན་པ་རྣམས་སམ། བསམ་གཏན་རྣམས་སམ། ཚད་མེད་པ་རྣམས་སམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། རྣམ་པར་ཐར་པ་བརྒྱད་དམ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་འམ། མངོན་པར་ཤེས་པ་རྣམས་སམ། ཏིང་ངེ་འཛིན་རྣམས་སམ། གཟུངས་ཀྱི་སྒོ་རྣམས་སམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སམ། མི་འཇིགས་པ་རྣམས་སམ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་སམ། སྙིང་རྗེ་ཆེན་པོ་འམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སམ། དགེ་བའི་ཆོས་གང་དང་གང་རྩོམ་པ་དེ་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་ཏེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་།
en: Therefore, bodhisattva great beings, from the time when they begin to set their minds on enlightenment, know that all these virtuous attributes that they undertake are like a magical display, whether they be the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, or the eighteen distinct qualities of the buddhas. {

source: དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་པོ་དེ་དག་ཡོངས་སུ་རྫོགས་པར་མ་བྱས་པར་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་འམ།
en: VIII: 166} “Beings cannot be brought to maturation or attain all-aspect omniscience without their having perfected the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱ་བར་མི་ནུས་པས། དེའི་ཕྱིར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། དགེ་བའི་ཆོས་གང་དང་གང་རྩོམ་ཡང་དེ་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུར་ཤེས་སོ།
en: So it is for this reason that bodhisattva great beings practice the perfection of wisdom and they know that whichever virtuous attributes they undertake are like a dream.

source: །སྒྲ་བརྙན་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུར་ཤེས་སོ། །དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲི
en: They know they that these are like an echo, like an optical aberration, like a mirage, like a magical display, and like a phantom emanation. “

source: མས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྨི་ལམ་ལྟ་བུར་ཤེས་སོ།
en: When they practice the perfection of wisdom, they know that the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, the eighteen distinct qualities of the buddhas, and [the goals], up to and including all-aspect omniscience, are like a dream.

source: །སྒྲ་བརྙན་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུར་རབ་ཏུ་ཤེས་སོ།
en: They know they that these are like an echo, like an optical aberration, like a mirage, like a magical display, and like a phantom emanation.

source: །སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་རྨི་ལམ་ལ་སྤྱོད་དོ་ཞེས་བྱ་བར་ཤེས་སོ། །སྒྲ་བརྙན་དང་། མིག་ཡོར་དང་། སྨིག་རྒྱུ་དང་། སྒྱུ་མ་དང་།
en: They know that all beings are acting in a dream, and acting in [the manner of] an echo, an optical aberration, a mirage, a magical display, and a phantom emanation.

source: སྤྲུལ་པ་ལ་སྤྱོད་དོ་ཞེས་བྱ་བར་ཤེས་སོ། །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Therefore, when bodhisattva great beings practice the perfection of wisdom, {Ki.

source: རྨི་ལམ་ལྟ་བུའི་ཆོས་རྣམས་དངོས་པོ་མེད་པར་འཛིན་ཏེ། དེ་ལྟར་བཟུང་ཞིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྒྲ་བརྙན་ལྟ་བུ་དང་།
en: VIII: 167} they hold dreamlike attributes to be nonentities, and holding them as such, they do attain all-aspect omniscience.

source: མིག་ཡོར་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུའི་ཆོས་རྣམས་དངོས་པོ་མེད་པར་འཛིན་ཏེ། དེ་ལྟར་བཟུང་ཞིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ།
en: When bodhisattva great beings practice the perfection of wisdom, they hold attributes that are like an echo, like an optical aberration, like a mirage, like a magical display, and like a phantom emanation to be nonentities, and holding them as such, they do attain all-aspect omniscience. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཟུང་དུ་མེད་དོ།
en: The perfection of wisdom cannot be grasped.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཟུང་དུ་མེད་དོ།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity cannot be grasped.

source: །ནང་སྟོང་པ་ཉིད་ཀྱང་གཟུང་དུ་མེད་དོ།
en: The emptiness of internal phenomena cannot be grasped. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡང་གཟུང་དུ་མེད་དོ། །དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, cannot be grasped.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་གཟུང་དུ་མེད་དོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: The applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path cannot be grasped.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་གཟུང་དུ་མེད་དོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways cannot be grasped.
